app/controllers/theaters_controller.rb

  def index
    @theaters = Theater.all
---
SELECT "theaters".* FROM "theaters"

  def create
    m = Theater.new
    m.name = params[:name]
    m.address = params[:address]
    m.phone = params[:phone]
    m.save
---
INSERT INTO "theaters" ("address", "name", "phone") VALUES (?, ?, ?)  [["address", "dsakfl"], ["name", "kdad"], ["phone", "3810"]]

  def edit
    @theater = Theater.find_by_id(params[:id])
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1

  def update
    @theater = Theater.find_by_id(params[:id])
    @theater.name = params[:name]
    @theater.address = params[:address]
    @theater.phone = params[:phone]
    @theater.save
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1
UPDATE "theaters" SET "name" = 'ASD', "address" = 'FSF', "phone" = NULL WHERE "theaters"."id" = 5

  def destroy
    theater = Theater.find_by_id(params[:id])
    theater.destroy
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 2 LIMIT 1
DELETE FROM "theaters" WHERE "theaters"."id" = ?  [["id", 2]]